<a href="https://colab.research.google.com/github/deepali25-05/DS_Rcodes/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Import Python Libraries
import numpy as np
import pandas as pd

#Read csv file
df = pd.read_csv("/content/Salaries.csv")

In [2]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [3]:
df = df.head(50)

In [ ]:
df

In [5]:
df = df.head(10)

In [6]:
df

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [7]:
df = df.head(20)

In [8]:
df

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [9]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [10]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [11]:
df.shapes

AttributeError: ignored

In [12]:
df.shape

(10, 6)

In [13]:
df.ndim

2

In [14]:
df.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [15]:
df.size

60

In [16]:
# Data Frame Methods
df.describe()

            phd    service        salary
count  10.00000  10.000000      10.00000
mean   28.90000  24.900000  110861.50000
std    14.99222  14.517805   34793.26364
min    12.00000   6.000000   57800.00000
25%    20.00000  18.000000   93337.50000
50%    21.50000  19.500000  107657.50000
75%    37.25000  28.250000  125325.00000
max    56.00000  51.000000  186960.00000

In [17]:
df.mean()

phd            28.9
service        24.9
salary     110861.5
dtype: float64

In [18]:
df.median()

phd            21.5
service        19.5
salary     107657.5
dtype: float64

In [19]:
df.count()

rank          10
discipline    10
phd           10
service       10
sex           10
salary        10
dtype: int64

In [20]:
df.std()

phd           14.992220
service       14.517805
salary     34793.263640
dtype: float64

In [21]:
df = pd.read_csv("/content/Salaries.csv")

In [22]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [23]:
df.phd

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [24]:
df['phd']

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [25]:
df[['phd']]

    phd
0    56
1    12
2    23
3    40
4    20
..  ...
73   18
74   19
75   17
76   28
77   23

[78 rows x 1 columns]

In [26]:
mean('phd')

NameError: ignored

In [27]:
mean['phd']

NameError: ignored

In [28]:
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [29]:
df.phd.count()

78

In [30]:
df.phd.mean()

19.705128205128204

In [31]:
#calculate mean salary for each professor rank
df.groupby('rank')[['salary']].mean()

                  salary
rank
AssocProf   91786.230769
AsstProf    81362.789474
Prof       123624.804348

In [ ]:
df[df['salary']>120000]

In [ ]:
df[df['discipline']=="B"]

In [36]:
df[df['rank']=="Professor"]

Empty DataFrame
Columns: [rank, discipline, phd, service, sex, salary]
Index: []

In [38]:
df.groupby['rank']=="Professor"['discipline']=="A"

TypeError: ignored

In [41]:
(df['discipline']=="B")$(df['rank']=="Prof")

SyntaxError: ignored

In [45]:
df.head(5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

SyntaxError: ignored

In [47]:
df['service']

0     49
1      6
2     20
3     31
4     18
      ..
73    10
74     6
75    17
76    14
77    15
Name: service, Length: 78, dtype: int64

SyntaxError: ignored

In [49]:
df.iloc[0:4]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205

In [50]:
df.iloc[2:7]

        rank discipline  phd  service   sex  salary
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [51]:
df.iloc[1:6,0:3]

   rank discipline  phd
1  Prof          A   12
2  Prof          A   23
3  Prof          A   40
4  Prof          B   20
5  Prof          A   20

In [ ]:
df

# New Section